Revit 2024 API
ScheduleDefinition.CanHaveEmbeddedSchedule Method
 Indicates if this ScheduleDefinition can have an embedded ScheduleDefinition added.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool CanHaveEmbeddedSchedule()
Visual Basic
Public Function CanHaveEmbeddedSchedule As Boolean
Visual C++
public:
bool CanHaveEmbeddedSchedule()
Return Value
 True if this ScheduleDefinition can have an embedded ScheduleDefinition, false otherwise.
Remarks
Only schedules of the following categories can have an embedded ScheduleDefinition:
Rooms
Spaces
Electrical Circuits
Duct Systems
Piping Systems
Mechanical Equipment Sets
MEP Fabrication Ductwork
Fabrication Ductwork Stiffeners
Key schedules cannot have embedded schedules.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace